[
  {
    "id": "mentorship_2018Visualizing",
    "title": "Visualizing Behavior of AI Players in Computer Games",
    "year": "2018",
    "description": "In this project, the student explored training and tracking the behavior of artificial intelligence (AI) of playing the computer game Super Mario World. The visualizations helped to track the evolving learning of AI models across generations (genetic algorithm used to train AI model) for a game stage and its generalization to other stages (see figure). This project laid the groundwork for a future bachelor thesis aimed at expanding these techniques for broader applications beyond video games.",
    "status": "",
    "program": "Bachelor",
    "type": "Project",
    "keywords": "AI, Computer Games, Game analytics",
    "co-mentors": "",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2018Visualizing/mentorship_2018Visualizing.PNG",
    "links": {}
  },
  {
    "id": "mentorship_2019Visualizing",
    "title": "Visualizing Behavior of AI Players in Computer Games",
    "year": "2019",
    "description": "This thesis explores the concept of improving game designs by testing video games, specifically Sonic the Hedgehog. While testing video games is essential, it can be expensive and time-consuming when done by people. Instead, AI can be used to play the games, gathering valuable data. This data is too large to analyze manually, so it is summarized and visualized to make it understandable and improve the game design. This project builds on a previous bachelor project, creating a system to help visualize and understand how AI learns and evolves in games.",
    "status": "",
    "program": "Bachelor",
    "type": "Thesis",
    "keywords": "AI, Computer Games, Game analytics",
    "co-mentors": "",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2019Visualizing/cover.PNG",
    "links": {}
  },
  {
    "id": "mentorship_2020Citations",
    "title": "Analyzing Citations of a Research Publication Over Time",
    "year": "2020",
    "description": "Understanding why researchers cite specific papers is crucial yet complex. Addressing this challenge, an innovative approach called Context Citation Analyzer was created under the mentorship. It first automatically deciphers the context behind each citation in academic articles. Subsequently, it transforms this intricate information into clear, engaging visualization that illustrate citation counts grouped by their context. Notably, the tool adeptly manages instances where a paper is cited for multiple reasons, presenting this overlapping data accessibly. This work provides the research community with a powerful means to track knowledge transfer and evaluate scholarly impact more profoundly.",
    "status": "",
    "program": "Master",
    "type": "Project",
    "keywords": "Dynamic Sets",
    "co-mentors": "Prof. Jaya Sreevalsan Nair",
    "at": "Internattional Institute of Information Technology, Bangalore, India",
    "image": "/mentorship/mentorship_2020Citations/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2020Mario",
    "title": "Interactive Construction of Reward Functions",
    "year": "2020",
    "description": "Guiding AI agents, like one learning to play Super Mario Bros., involves setting clear goals or 'reward functions.' This mentored project investigated how these functions work, rewarding the AI for desired actions like finishing levels or grabbing coins. The challenge lies in defining these functions perfectly, as AI can sometimes exploit loopholes or follow flawed rules, leading to unexpected gameplay. Addressing this, the research explored building these vital reward functions interactively. This innovative approach seeks to prevent undesirable AI strategies and make the learning process more aligned with human intentions, leading to better-performing agents.",
    "status": "",
    "program": "Master",
    "type": "Project",
    "keywords": "AI, Game Analytics",
    "co-mentors": "Prof. Jaya Sreevalsan Nair",
    "at": "Internattional Institute of Information Technology, Bangalore, India",
    "image": "/mentorship/mentorship_2020Mario/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2020Training",
    "title": "Visualizing AI Agents based on Training History in Multi-Player Game Environments",
    "year": "2020",
    "description": "How do artificial intelligence agents actually learn to play, or even design, video games? Addressing this, a new web-based tool called ProgressAI was developed under mentorship. This framework uniquely visualizes the entire training history of two interacting AI agents within a Mario game environment – one agent plays as Mario, while the other designs the levels. By displaying their step-by-step learning progress, ProgressAI helps researchers understand how these agents develop strategies and interact over time. This provides crucial insights into AI learning patterns in complex scenarios, offering a foundation for building smarter, more understandable game AI.",
    "status": "",
    "program": "Master",
    "type": "Project",
    "keywords": "AI, Game Analytics",
    "co-mentors": "Prof. Jaya Sreevalsan Nair",
    "at": "Internattional Institute of Information Technology, Bangalore, India",
    "image": "/mentorship/mentorship_2020Training/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2020Reports",
    "title": "Interactive Visualization Interfaces for Statistical Reports",
    "year": "2020",
    "description": "How can we make important statistical information, like national fisheries data, more accessible and engaging for everyone? Developed under mentorship, this project transforms dense government reports into interactive digital stories. Focusing on India's 2018 Fisheries Statistics Handbook, it utilizes a user-friendly website, dynamic dashboards (using Tableau), and online quizzes to present complex data visually. The goal is to move beyond traditional tables and charts, sparking interest and improving understanding of the vital fisheries sector among a broader audience. This innovative approach demonstrates how multimedia can effectively communicate complex information and boost public awareness.",
    "status": "",
    "program": "Master",
    "type": "Project",
    "keywords": "Data Storytelling, Interactive Media",
    "co-mentors": "Prof. Jaya Sreevalsan Nair",
    "at": "Internattional Institute of Information Technology, Bangalore, India",
    "image": "/mentorship/mentorship_2020Reports/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2020Visual",
    "title": "Visual Comparison of Reinforcement Learning Algorithms based on their Performance",
    "year": "2020",
    "description": "Most comparisons of reinforcement learning algorithms focus solely on reward outcomes, offering limited insights. This thesis demonstrated a more comprehensive approach of visualizing multiple performanceindicators using line graphs and parallel coordinates. This gave detailed insights into each algorithm's performance over time and the relationships between different indicators. Users can filter data to focus on specific aspects, reducing complexity. This method allows for a task-oriented comparison, offering valuable insights for practical applications, though it is specific to the task at hand.",
    "status": "",
    "program": "Bachelor",
    "type": "Thesis",
    "keywords": "AI",
    "co-mentors": "",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2020Visual/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2020Visualization",
    "title": "Visualization of Innovative Capacity in Regional Innovation Systems of Medical Devices for Cardiovascular Disease",
    "year": "2020",
    "description": "This bachelor thesis proposed to explore the innovative capacity of regional systems in the medical device sector for cardiovascular disease. By applying established computer science visualization techniques, the project aimed to support health economics. In collaboration with a health economics research center, the thesis aimed to focus on identifying innovation hubs and their connections using data from PubMed. However, sadly the thesis was not completed due to the student's circumstances.",
    "status": "Incomplete",
    "program": "Bachelor",
    "type": "Thesis",
    "keywords": "Medical Devices, Health Informatics",
    "co-mentors": "",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2020Visualization/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2021Interactive",
    "title": "Towards Interactive Data Comics",
    "year": "2021",
    "description": "This thesis explored interactive storytelling with data in the popular format of comics. By incorporating multimedia and user-controlled features, the thesis aimed to make data stories more engaging and interesting. The interactions are demonstrated through three stories focusing on various aspects of the COVID-19 pandemic in Germany, encouraging readers to explore and understand the data more deeply.",
    "status": "",
    "program": "Bachelor",
    "type": "Thesis",
    "keywords": "Data Comics, Data Storytelling, Interactive Media",
    "co-mentors": "",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2021Interactive/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2021EventSequences",
    "title": "Visual Comparison of Event Sequences and Supporting Hypotheses Generation for Emergency Training",
    "year": "2021",
    "description": "This outstanding thesis introduced an innovative visual analytic system aimed at enhancing the triage process for accident victims. By analyzing sequences from triage training videos, the system supports experts in improving communication and teamwork. It includes a glyph-based graph and a timeline for visualizing and comparing training sessions, along with a pattern-finding algorithm for identifying communication patterns. Expert evaluations confirmed its effectiveness in data comparison and hypothesis generation. The system's adaptable design holds potential for broader applications in analyzing time-dependent event data.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Event Sequences, Team Dynamics, Visual Analytics",
    "co-mentors": "",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2021EventSequences/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2021Visualizing",
    "title": "Visualizing Evolution of Collaboration among Organizations",
    "year": "2021",
    "description": "This thesis developed a visualization approach to explore and understand academic collaboration networks, which are crucial for scientific productivity. The approach uses time series, geospatial maps, and node-link graphs to represent collaborations between countries, research institutions, and universities. Interactive features allow users to explore different aspects of the data, enhancing clarity and insight. The work demonstrated valuable insights into the dynamics of academic collaboration over time.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Group Dynamics, Visual Analytics",
    "co-mentors": "",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2021Visualizing/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2021Visual",
    "title": "Visualizing Game AI and Human Collaborative GamePlay Behavior",
    "year": "2021",
    "description": "Game AI research is expanding beyond creating agents that compete with professional players to developing AI that collaborates with humans. This shift presents challenges, as existing algorithms aren't designed for teamwork. Understanding which collaborative behaviors are learned and exhibited by AI can enhance its development, but discovering them remained a challenge. This thesis reviewed the related potential visualizations and proposed  new apptoach to analyze interactions between AI and human players. Using data from a game environment based on Overcooked, a tool was developed to successfully visualize AI and human teamwork via interactive visualizations, revealing unknown collabotion strategies and behaviors.",
    "status": "",
    "program": "Bachelor",
    "type": "Thesis",
    "keywords": "AI, Game Analytics, Human-AI Collaboration, Group Dynamics, Visual Analytics",
    "co-mentors": "",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2021Visual/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2021Workshop",
    "title": "Visually Analysing Spatio-Temporal Workshop Production Data through Dynamic Graphs",
    "year": "2021",
    "description": "With the rise of geo-tracking in devices, vast amounts of location-based data are being generated. While computers can process this data, human insight is needed to interpret it meaningfully. This thesis presented a method to analyze and understand such data in a factory setting. Using movement data from pallets tracked with markers, a prototype visualization approach was developed and tested with experts. It integrates heatmap visualizations to highlight key areas and a dynamic graph to show movement patterns. Expert feedback confirmed that this approach effectively analyzes spatial and temporal data, helping identify important areas and movement patterns in production and storage. This understanding can improve machine operations and pallet handling, benefiting business operations.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Industrial Analytics, Group Dynamics, Visual Analytics",
    "co-mentors": "",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2021Workshop/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2022Visually",
    "title": "Visually Exploring Team Communication and Gameplay Events in League of Legends",
    "year": "2022",
    "description": "This project developed a prototype for the underexplored area of visually analyzing team communication. The work takes League of Legends as a case study. It features four components: a Scoreboard, Voice Activity Bar Chart, Terminology Word Cloud, and Event Timeline. These linked views allow users to explore and identify their strengths and weaknesses. The findings demonstrate that specific insights can be gained from individual matches, and the prototype offers potential for further development to enhance quantitative analysis.",
    "status": "",
    "program": "Master",
    "type": "Project",
    "keywords": "Team Communication, Game Analytics, Group Dynamics, Visual Analytics",
    "co-mentors": "Cedric Krause",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2022Visually/cover.png",
    "links": {}
  },

  {
    "id": "mentorship_2022Assisting",
    "title": "Assisting the Creation of Data Comics with Knowledge Graphs",
    "year": "2022",
    "description": "This thesis explored an interesting concept of using Knowledge Graphs to create Data Comics, which are tools for visual storytelling with data. Creating Data Comics is typically complex, but the proposed framework simplifies this by streamlining data acquisition, formatting, and visualization. Its modular design allows for component reuse and integration with other tools. The 'Comic Templating' feature lets authors create an interactive Data Comic once and easily generate similar ones. By integrating Knowledge Graphs, users can explore the data behind a Data Comic and related information.",
    "status": "",
    "program": "Master",
    "type": "Project",
    "keywords": "Data Comics, Data Storytelling, Knowledge Graphs",
    "co-mentors": "",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2022Assisting/cover.png",
    "links": {}
  },

  {
    "id": "mentorship_2022Bomberland",
    "title": "Visual Analysis of AI Behavior in the Environment of Bomberland",
    "year": "2022",
    "description": "This thesis explores how visual tools can help developers understand and improve AI behavior in games, using the Bomberland competition as a case study. By analyzing data from AI matches, the research aims to make it easier to compare strategies and identify areas for improvement. The thesis introduces a web-based tool that uses various visualizations to simplify complex data, making it accessible even to non-experts. Interviews with competition organizers provided valuable insights and data, which were used to design the visualizations. The tool allows users to analyze AI strategies in real-time, offering a new way to enhance AI development. Feedback from a survey of AI developers confirmed the tool's effectiveness, though it highlighted the need for further refinement. This work builds on previous research and sets the stage for future advancements in AI analysis.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "AI, Game Analytics, Group Dynamics, Visual Analytics",
    "co-mentors": "Shahid Latif",
    "at": "University of Duisburg-Essen, Germany",
    "image": "/mentorship/mentorship_2022Bomberland/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2023Gamified",
    "title": "Gamified visualizations to understand the concept of fairness and bias in machine learning",
    "year": "2023",
    "description": "This thesis explores the use of gamified visualizations to help non-experts understand fairness and bias in machine learning. As AI technologies rapidly evolve, they pose challenges and risks, such as biased decision-making. The research addresses the gap in educational tools by creating interactive visualizations that incorporate game-like elements, making complex AI concepts more accessible. Prototypes were developed and tested, revealing both the potential and challenges of this approach. The work highlights the importance of educating the public to ensure AI benefits everyone, proposing gamified visualizations as a powerful tool for empowerment and understanding. This innovative approach aims to enhance transparency and engagement in AI literacy.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "AI, Fairness, Bias, Gamification",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2023Gamified/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2023Visual",
    "title": "Visual Specification and Exploration of Rules to Generate  Game Levels with Wave Function Collapse Algorithm",
    "year": "2023",
    "description": "In this innovative thesis, the student explored the use of the Wave Function Collapse algorithm to enhance game level design. This research introduced a web-based tool that visualizes the rules and restrictions of this algorithm, allowing designers to critically assess and refine level generation processes. By focusing on two-dimensional tile-based levels, the tool aids in understanding how different tiles interact, ensuring levels are both playable and engaging. The study also highlighted the importance of visualizing accessibility within levels, although it did not delve into player behavior. This work offers practical insights for game developers, emphasizing the potential of procedural content generation to create dynamic and varied gaming experiences.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Game Design, Game Analytics, Visual Analytics",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2023Visual/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2023DataComics",
    "title": "Analyzing and Exploring the Design of Data Comics",
    "year": "2023",
    "description": "In a world overflowing with data, this thesis makes complex information more accessible through data comics. These comics blend the visual appeal of infographics with the narrative flow of comic strips, offering a novel way to present data step-by-step. The research involved analyzing 31 existing data comics to understand their design and exploring new visualization techniques to enhance them. By creating and evaluating five comic prototypes, the study provided insights into integrating complex data into engaging narratives. This work highlights the potential of data comics to improve public understanding and decision-making in an increasingly data-driven society.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Data Comics, Data Storytelling",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2023DataComics/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2023Diplomacy",
    "title": "Visual analysis of AI behavior in Diplomacy",
    "year": "2023",
    "description": "In a world increasingly influenced by Artificial Intelligence (AI), this thesis delves into the intriguing intersection of AI and the classic board game, Diplomacy. By examining AI behavior within this strategic game, the work uncovers valuable insights into game theory, social dynamics, and algorithmic progress. The study not only highlights the synergy between AI and human players but also emphasizes the timeless relevance of Diplomacy, akin to chess. The research addresses existing gaps in visualizing and analyzing the game, aiming to develop an application that enhances understanding of AI decision-making and improves gameplay strategies. This visualization offers practical benefits for players, coaches, and enthusiasts alike.",
    "status": "",
    "program": "Bachelor",
    "type": "Thesis",
    "keywords": "AI, Game Theory, Group Dynamics",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2023Diplomacy/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2023Poker",
    "title": "Visual Analytics of Event Sequence Data in Poker",
    "year": "2023",
    "description": "With online poker's popularity skyrocketing during the pandemic, this thesis tackles a crucial challenge: how to help players learn from their games more effectively. By analyzing the complex sequence of poker hands and player actions, the study introduces an innovative approach to reviewing gameplay. The research focuses on Texas Hold'em, where players can play 75-100 hands per hour, making traditional hand-by-hand analysis time-consuming. The work proposes a sequential perspective to visualize dynamic game processes, helping players better understand their decisions and improve their strategy.",
    "status": "",
    "program": "Bachelor",
    "type": "Thesis",
    "keywords": "Event Sequences, Visual Analytics",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2023Poker/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2024EventSequences",
    "title": "Visual Analysis and Interactive Clustering of Event Sequences",
    "year": "2024",
    "description": "In a bid to enhance e-commerce experiences, this thesis explores the use of interactive clustering to analyze customer journeys. By leveraging event sequence data, the study aims to improve understanding of user behavior on websites. The innovative approach combines various visualizations, to offer both an overview and detailed insights into customer interactions. This method allows for the identification of unusual patterns and enhances decision-making in marketing and user experience design. This work, conducted with data from a musical instrument retailer, highlights the potential of interactive clustering to reveal valuable customer insights, ultimately aiding in boosting sales and refining marketing strategies.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Event Sequences, Interactive Clustering, E-commerce",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2024EventSequences/cover.png",
    "links": {}
  },

  {
    "id": "mentorship_2023Effectiveness",
    "title": "Effectiveness and Usability Towards Data-Driven Storytelling: A Comparison of Interactive Infographics and Data Comics",
    "year": "2023",
    "description": "In an era where visual communication increasingly shapes public understanding, this master's thesis investigates the effectiveness of interactive data storytelling formats. It compares interactive infographics and data comics, two popular methods for presenting complex information to the general public. Building on previous research that found static data comics more effective than static infographics, the work explores whether these findings hold true for interactive versions. Through user studies and prototype development, the research examines both effectiveness and usability factors, including engagement, understanding, and user satisfaction. The findings aim to guide journalists and content creators in choosing the most effective format for their data-driven stories, particularly in online journalism where accessibility to diverse audiences is crucial.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Data Comics, Data Storytelling, Interactive Media",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2023Effectiveness/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2023DynamicSet",
    "title": "Dynamic Set Visualization: A User Study",
    "year": "2023",
    "description": "Visualizing how groups change over time presents a unique challenge in data analysis. This thesis investigates three innovative approaches to visualizing dynamic sets: PAOHvis, TimeSets, and Set Streams. Through a comprehensive user study, the work evaluates how effectively these techniques help users understand evolving relationships between different groups. The findings aim to establish best practices for dynamic set visualization, identify key tasks that need support, and determine the strengths and limitations of current approaches. It revealed valuable insights for data analysts and visualization experts working with time-evolving data, offering practical guidance for choosing and designing dynamic set visualization techniques.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Dynamic Sets",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2023DynamicSet/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2023KNN",
    "title": "K-Nearest-Neighbor learning application in Augmented Reality",
    "year": "2023",
    "description": "Machine learning's growing influence in everyday life has created an urgent need for accessible educational tools. This master's project introduces an innovative approach to teaching machine learning basics through an interactive Augmented Reality application for the HoloLens device. The application features a K-Nearest-Neighbor classifier that users can train and test in an immersive 3D environment. By combining playful techniques with visualizations, the work demonstrates how complex machine learning concepts can be made accessible to non-technical users. The project leverages the advantages of Augmented Reality technology to create an engaging learning experience, while addressing the challenges of implementing educational content in mixed reality environments.",
    "status": "",
    "program": "Master",
    "type": "Project",
    "keywords": "Machine Learning, Augmented Reality, Visual Analytics",
    "co-mentors": "Cedric Krause",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2023KNN/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2023Confusion",
    "title": "Visual Analysis and Comparison of the Confusion in Multi-Label Classifiers",
    "year": "2023",
    "description": "With the explosion of digital data in recent years, the challenge of accurately categorizing information has become increasingly complex. This thesis tackles a specific challenge in machine learning: how to effectively compare and visualize the performance of different multi-label classifiers in a storytelling format. The work introduces an innovative approach that combines automatic detection of relevant confusion patterns with template-based text generation to create clear, understandable visualizations. By focusing on the interconnected nature of multi-label classifications, the thesis provides practical tools to better understand and compare classifier performance, ultimately leading to more informed model selection decisions.",
    "status": "",
    "program": "Bachelor",
    "type": "Thesis",
    "keywords": "Multi-label Classification",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2023Confusion/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2024Sentiment",
    "title": "Visual Exploration of Sentiment and Keywords from Social Media Posts",
    "year": "2024",
    "description": "Social media platforms have become powerful tools for understanding public opinion and trends, but analyzing their vast amounts of data presents significant challenges. This thesis introduces an innovative visual analytics tool that combines sentiment analysis and keyword extraction to make social media data more accessible and understandable. The work addresses a critical gap in existing tools, which often focus on geospatial data or topics while neglecting the rich textual content that reveals what people are saying and how they're saying it. By developing an intuitive interface that integrates multiple visualization techniques, the research enables users of varying expertise levels to explore and derive meaningful insights from social media discourse. The tool's design emphasizes three key aspects: data-appropriate visualizations, interactive exploration capabilities, and effective insight derivation.",
    "status": "",
    "program": "Bachelor",
    "type": "Thesis",
    "keywords": "Sentiment Analysis, Social Media Analytics, Visual Analytics",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2024Sentiment/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2024Journalism",
    "title": "Exploring Interactive Data-Driven Storytelling in Local Journalism",
    "year": "2024",
    "description": "Through analysis of 30 articles from six local media outlets, this thesis studies local journalism already incorporates data elements similar to national publications, but with a unique local focus. The research develops four innovative storytelling concepts: text-centric with visual extensions, visualization-centric with text support, time-based topic summaries, and map-based article organization. Expert interviews with journalists confirm the potential of data-driven storytelling in local contexts while highlighting resource constraints. This work provides actionable insights for modernizing local journalism through interactive data visualization, ensuring communities maintain access to professional, engaging local news in the digital age.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Data Comics, Data Storytelling, Journalism",
    "co-mentors": "",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2024Journalism/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2024Personalization",
    "title": "Personalization in Interactive Data Comics",
    "year": "2024",
    "description": "Imagine a world where data stories adapt to each reader's interests and experiences. This innovative thesis explores how personalization can transform interactive data comics into engaging, self-reflective experiences. It introduces a novel framework for creating personalized data stories that adapt to user characteristics and incorporate personal data, making complex information more relatable and memorable.",
    "status": "",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Personalization, Data Comics, Data Storytelling",
    "co-mentors": "Fabian Beck",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2024Personalization/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2024MixedReality",
    "title": "Visualizing Player Movement and Events in Video Games through Space-Time Cubes in Mixed Reality",
    "year": "2024",
    "description": "Step into a world where game data comes alive in three dimensions. This exciting and innovative thesis introduces PomXR, an innovative Mixed Reality visualization tool that transforms how we understand player movements and game events. By combining spatial and temporal data in an immersive 3D environment, this research revolutionizes game analytics for both developers and players.",
    "status": "",
    "program": "Bachelor",
    "type": "Thesis",
    "keywords": "Mixed Reality, Game Analytics, Visual Analytics",
    "co-mentors": "Fabian Beck",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2024MixedReality/cover.png",
    "links": {}
  },
  {
    "id": "mentorship_2025Onboarding",
    "title": "Exploring The Onboarding To Dashboards With Data Comics",
    "year": "2025",
    "description": "How do you understand a complex dashboard without any guidance? The thesis proposes exploring how the familiar format of comics can transform how we learn to use data dashboards. By combining the engaging narrative structure of comics with interactive data visualizations, this research introduces an innovative approach to making complex dashboards more accessible to non-expert users",
    "status": "Ongoing",
    "program": "Master",
    "type": "Thesis",
    "keywords": "Data Comics, Data Storytelling, User Onboarding",
    "co-mentors": "Leah Mühlöder",
    "at": "University of Bamberg, Germany",
    "image": "/mentorship/mentorship_2025Onboarding/cover.png",
    "links": {}
  }
]
