{
  "items": {
    "publications/Agarwal2020Bombalytics": {
      "id": "Agarwal2020Bombalytics",
      "type": "publication",
      "title": {
        "original": "Bombalytics: Visualization of Competition and Collaboration Strategies of Players in a Bomb Laying Game",
        "fallback": "Bombalytics: Visualization of Competition and Collaborati..."
      },
      "description": {
        "original": "Competition and collaboration form complex interaction patterns between the agents and objects involved. Only by understanding these interaction patterns, we can reveal the strategies the participating parties applied. In this paper, we study such competition and collaboration behavior for a computer game. Serving as a testbed for artificial intelligence, the multiplayer bomb laying game Pommerman provides a rich source of advanced behavior of computer agents. We propose a visualization approach that shows an overview of multiple games, with a detailed timeline-based visualization for exploring the specifics of each game. Since an analyst can only fully understand the data when considering the direct and indirect interactions between agents, we suggest various visual encodings of these interactions. Based on feedback from expert users and an application example, we demonstrate that the approach helps identify central competition strategies and provides insights on collaboration.",
        "fallback": "Competition and collaboration form complex interaction patterns between the agents and objects involved."
      }
    },
    "publications/Agarwal2020SetStreams": {
      "id": "Agarwal2020SetStreams",
      "type": "publication",
      "title": {
        "original": "{Set Streams}: Visual Exploration of Dynamic Overlapping Sets",
        "fallback": "{Set Streams}: Visual Exploration of Dynamic Overlapping ..."
      },
      "description": {
        "original": "In many applications, membership of set elements changes over time. Since each element can be present in multiple sets, the sets also overlap. As a result, it becomes challenging to visualize the temporal change in set membership of elements across several timesteps while showing individual set intersections. We propose Set Streams, a visualization technique that represents changing set structures on a timeline as branching and merging streams. The streams encode the changing membership of elements with set intersections. A query-based selection mechanism supports a flexible comparison of selected groups of elements across the temporal evolution. The main timeline view is complemented with additional panels to provide details about the elements. While the proposed visualization is an application-independent visualization technique for dynamic sets, we demonstrate its effectiveness and applicability through three diverse application examples and expert feedback.",
        "fallback": "In many applications, membership of set elements changes over time. Since each element can be present in multiple sets, the sets also overlap."
      }
    },
    "publications/Krause2023Visually": {
      "id": "Krause2023Visually",
      "type": "publication",
      "title": {
        "original": "Visually Abstracting Event Sequences as Double Trees Enriched with Category-Based Comparison",
        "fallback": "Visually Abstracting Event Sequences as Double Trees Enri..."
      },
      "description": {
        "original": "Abstract Event sequence visualization aids analysts in many domains to better understand and infer new insights from event data. Analysing behaviour before or after a certain event of interest is a common task in many scenarios. In this paper, we introduce, formally define, and position double trees as a domain-agnostic tree visualization approach for this task. The visualization shows the sequences that led to the event of interest as a tree on the left, and those that followed on the right. Moreover, our approach enables users to create selections based on event attributes to interactively compare the events and sequences along colour-coded categories. We integrate the double tree and category-based comparison into a user interface for event sequence analysis. In three application examples, we show a diverse set of scenarios, covering short and long time spans, non-spatial and spatial events, human and artificial actors, to demonstrate the general applicability of the approach.",
        "fallback": "Abstract Event sequence visualization aids analysts in many domains to better understand and infer new insights from event data."
      }
    },
    "publications/Liebers2023Viscomet": {
      "id": "Liebers2023Viscomet",
      "type": "publication",
      "title": {
        "original": "{VisCoMET:} Visually Analyzing Team Collaboration in Medical Emergency Trainings",
        "fallback": "{VisCoMET:} Visually Analyzing Team Collaboration in Medi..."
      },
      "description": {
        "original": "Handling emergencies requires efficient and effective collaboration of medical professionals. To analyze their performance, in an application study, we have developed VisCoMET, a visual analytics approach displaying interactions of healthcare personnel in a triage training of a mass casualty incident. The application scenario stems from social interaction research, where the collaboration of teams is studied from different perspectives. We integrate recorded annotations from multiple sources, such as recorded videos of the sessions, transcribed communication, and eye-tracking information. For each session, an information-rich timeline visualizes events across these different channels, specifically highlighting interactions between the team members. We provide algorithmic support to identify frequent event patterns and to search for user-defined event sequences. Comparing different teams, an overview visualization aggregates each training session in a visual glyph as a node, connected to similar sessions through edges. An application example shows the usage of the approach in the comparative analysis of triage training sessions, where multiple teams encountered the same scene, and highlights discovered insights. The approach was evaluated through feedback from visualization and social interaction experts. The results show that the approach supports reflecting on teams performance by exploratory analysis of collaboration behavior while particularly enabling the comparison of triage training sessions.",
        "fallback": "Handling emergencies requires efficient and effective collaboration of medical professionals."
      }
    },
    "publications/Agarwal2017Nodetrix": {
      "id": "Agarwal2017Nodetrix",
      "type": "publication",
      "title": {
        "original": "{NodeTrix-Multiplex}: Visual Analytics of Multiplex Small World Networks",
        "fallback": "{NodeTrix-Multiplex}: Visual Analytics of Multiplex Small..."
      },
      "description": {
        "original": "Analyzing multiplex small world networks (SWNs) using community detection (CD) is a challenging task. We propose the use of visual analytics to probe and extract communities in such networks, where one of the layers defines the network topology and exhibits small-world property. Our novel visual analytics framework, NodeTrix-Multiplex (NTM), for visual exploration of multiplex SWNs, integrates focus+context network visualization, and analysis of community detection results, within the focus. We propose a heterogeneous data model, which composites multiple layers for the focus and context and thus, enables finding communities across layers. We perform a case-study on a co-authorship (collaboration) network, with a functional layer obtained from the author-topic similarity graph. We also perform an expert user evaluation of the tool, developed using NTM.",
        "fallback": "Analyzing multiplex small world networks (SWNs) using community detection (CD) is a challenging task."
      }
    },
    "publications/Nair2017Nodetrix": {
      "id": "Nair2017Nodetrix",
      "type": "publication",
      "title": {
        "original": "{NodeTrix-CommunityHierarchy}: Techniques for Finding Hierarchical Communities for Visual Analytics of Small-world Networks",
        "fallback": "{NodeTrix-CommunityHierarchy}: Techniques for Finding Hie..."
      },
      "description": {
        "original": "While there are several visualizations of the small world networks (SWN), how does one find an appropriate set of visualizations and data analytic processes in a data science workflow? Hierarchical communities in SWN aid in managing and understanding the complex network better. To enable a visual analytics workflow to probe and uncover hierarchical communities, we propose to use both the network data and metadata (e.g. node and link attributes). Hence, we propose to use the network topology and node-similarity graph using metadata, for knowledge discovery. For the construction of a four-level hierarchy, we detect communities on both the network and the similarity graph, by using specific community detection at specific hierarchical level. We enable the flexibility of finding non-overlapping or overlapping communities, as leaf nodes, by using spectral clustering. We propose NodeTrix-CommunityHierarchy (NTCH), a set of visual analytic techniques for hierarchy construction, visual explo ration and quantitative analysis of community detection results. We extend NodeTrix-Multiplex framework (Agarwal et al., 2017), which is for visual analytics of multilayer SWN, to probe hierarchical communities. We propose novel visualizations of overlapping and non-overlapping communities, which are integrated into the framework. We show preliminary results of our case-study of using NTCH on co-authorship networks.",
        "fallback": ""
      }
    },
    "publications/Lukose2018Design": {
      "id": "Lukose2018Design",
      "type": "publication",
      "title": {
        "original": "Design Study for Creating {Pathfinder}: A Visualization Tool for Generating Software Test Plans using Model based Testing",
        "fallback": "Design Study for Creating {Pathfinder}: A Visualization T..."
      },
      "description": {
        "original": "Model Based Testing (MBT) is a popularly used software testing technique in the software industry. However, there still exists a gap between the awareness of benefits of MBT and its adoption in the industry, specifically in the Computer Aided Design (CAD) or Computer Aided Engineering (CAE) domains. This can be predominantly attributed to the learning curve of using many of the existing MBT tools. To address this gap in the CAD/CAE industry, we propose Pathfinder - an MBT tool, with a Graphical User Interface (GUI), for guiding a software tester in generating test plans for a system-under-test (SUT). The goal of using Pathfinder is for obtaining consistency and reproducibility in the generated test plans across a team of software testers. Our tool introduces a novel representation of the SUT as a High-level Model (HLM), and the use of graph visualization for test plan generation from the HLM. We have designed the GUI to be intuitive for the tester to generate test plans and select re levant tests, which precedes the test execution done outside of our tool. Here, we discuss the design decisions we adopted towards creating Pathfinder, and demonstrates its usage with two case studies.",
        "fallback": "Model Based Testing (MBT) is a popularly used software testing technique in the software industry."
      }
    },
    "publications/Sreevalsan2017Collaborative": {
      "id": "Sreevalsan2017Collaborative",
      "type": "publication",
      "title": {
        "original": "Collaborative Design of Visual Analytic Techniques for Survey Data for Community-based Research in Public Health",
        "fallback": "Collaborative Design of Visual Analytic Techniques for Su..."
      },
      "description": {
        "original": "Visual analytics is widely adopted in iterative data science/analytic workflows where the human-in-the-loop uses the visualizations to make sense of the data. We are interested in the in-depth analysis of the surveys conducted for studying the effectiveness of public health programs, for which we propose the use of visual analytics. Here, a collaboration between researchers in public health and visualization has led to co-creation of workflows enabling visual analytic techniques for subject-centric raw data from the surveys. We build an appropriate data model which feeds into our proposed visualization techniques. We present a prototype implementation of our tool, SurveyVis, and demonstrate the usage of our tool in analyzing a public health program deployed in India.",
        "fallback": ""
      }
    },
    "publications/Agarwal2018Computer": {
      "id": "Agarwal2018Computer",
      "type": "publication",
      "title": {
        "original": "Computer-supported Interactive Assignment of Keywords for Literature Collections",
        "fallback": "Computer-supported Interactive Assignment of Keywords for..."
      },
      "description": {
        "original": "A curated literature collection on a specific topic helps researchers to find relevant articles quickly. Assigning multiple keywords to each article is one of the techniques to structure such a collection. But it is challenging to assign all the keywords consistently without any gaps or ambiguities. We propose to support the user with a machine learning technique that suggests keywords for articles in a literature collection browser. We provide visual explanations to make the keyword suggestions transparent. The suggestions are based on previous keyword assignments. The machine learning technique learns on the fly from the interactive assignments of the user. We seamlessly integrate the proposed technique in an existing literature collection browser and investigate various usage scenarios through an early prototype.",
        "fallback": "A curated literature collection on a specific topic helps researchers to find relevant articles quickly."
      }
    },
    "publications/Agarwal2020Visualizing": {
      "id": "Agarwal2020Visualizing",
      "type": "publication",
      "title": {
        "original": "Visualizing {AI} Playtesting Data of 2D Side-scrolling Games",
        "fallback": "Visualizing {AI} Playtesting Data of 2D Side-scrolling Games"
      },
      "description": {
        "original": "Human playtesting is a useful step in the game development process, but involves high economic costs and is time-consuming. While playtesting through artificial intelligence is gaining attention, it is challenging to analyze the collected data. We address the challenge by proposing visualizations to derive insights about level design in 2D side-scrolling games. To focus on the navigation behavior in the level design, we study the trajectories of computer agents trained using artificial intelligence. We demonstrate the effectiveness of our approach by implementing a web-based prototype and presenting the insights gained from the visualizations for the game Sonic the Hedgehog 2. We highlight lessons learned and directions to customize the approach for other analysis goals of playtesting.",
        "fallback": "Human playtesting is a useful step in the game development process, but involves high economic costs and is time-consuming."
      }
    },
    "publications/Agarwal2020Design": {
      "id": "Agarwal2020Design",
      "type": "publication",
      "title": {
        "original": "A Design and Application Space for Visualizing User Sessions of Virtual and Mixed Reality Environments",
        "fallback": "A Design and Application Space for Visualizing User Sessi..."
      },
      "description": {
        "original": "Virtual and mixed reality environments gain complexity due to the inclusion of multiple users and physical objects. A core challenge for developers and researchers while analyzing sessions from such environments lies in understanding the interaction between entities. Additionally, the raw data recorded from such sessions is difficult to analyze due to the simultaneous temporal and spatial changes of multiple entities. However, similar data has already been visualized in other areas of application. We analyze which aspects of these related visualizations can be leveraged for analyzing user sessions in virtual and mixed reality environments and describe a design and application space for such visualizations. First, we examine what information is typically generated in interactive virtual and mixed reality applications and how it can be analyzed through such visualizations. Next, we study visualizations from related research fields and derive seven visualization categories. These categories act as building blocks of the design space, which can be combined into specific visualization systems. We also discuss the application space for these visualizations in debugging and evaluation scenarios. We present two application examples that showcase how one can visualize virtual and mixed reality user sessions and derive useful insights from them.",
        "fallback": "Virtual and mixed reality environments gain complexity due to the inclusion of multiple users and physical objects."
      }
    },
    "publications/Agarwal2020VisualizingSets": {
      "id": "Agarwal2020VisualizingSets",
      "type": "publication",
      "title": {
        "original": "Visualizing Sets and Changes in Membership Using Layered Set Intersection Graphs",
        "fallback": "Visualizing Sets and Changes in Membership Using Layered ..."
      },
      "description": {
        "original": "Challenges in set visualization include representing overlaps among sets, changes in their membership, and details of constituent elements. We present a visualization technique that addresses these challenges. The approach uses set intersection graphs that explicitly visualize each set intersection as a rectangular node and elements as circles inside them. We represent the graph as a layered node-link diagram using colors to indicate the sets. The layers reflect different levels of intersections, from the base sets in the lowest layer to potentially the intersection of all sets in the highest layer. We provide different perspectives to show temporal changes in set membership. Graphs for individual, two, and all timesteps are visualized in static, diff, and aggregated views. Together with linked views and filters, the technique supports the detailed exploration of dynamic set data. We demonstrate the effectiveness of the proposed approach by discussing two application examples. The submitted supplemental material contains a video showing proposed interactions in the implementation and the prototype itself.",
        "fallback": "Challenges in set visualization include representing overlaps among sets, changes in their membership, and details of constituent elements."
      }
    },
    "publications/Agarwal2020How": {
      "id": "Agarwal2020How",
      "type": "publication",
      "title": {
        "original": "How Visualization PhD Students Cope with Paper Rejections",
        "fallback": "How Visualization PhD Students Cope with Paper Rejections"
      },
      "description": {
        "original": "We conducted a questionnaire study aimed towards PhD students in the field of visualization research to understand how they cope with paper rejections. We collected responses from 24 participants and performed a qualitative analysis of the data in relation to the provided support by collaborators, resubmission strategies, handling multiple rejects, and personal impression of the reviews. The results indicate that the PhD students in the visualization community generally cope well with the negative reviews and, with experience, learn how to act accordingly to improve and resubmit their work. Our results reveal the main coping strategies that can be applied for constructively handling rejected visualization papers. The most prominent strategies include: discussing reviews with collaborators and making a resubmission plan, doing a major revision to improve the work, shortening the work, and seeing rejection as a positive learning experience.",
        "fallback": ""
      }
    },
    "publications/Krause2021Visual": {
      "id": "Krause2021Visual",
      "type": "publication",
      "title": {
        "original": "Visual Comparison of Multi-label Classification Results",
        "fallback": "Visual Comparison of Multi-label Classification Results"
      },
      "description": {
        "original": "In multi-label classification, we do not only want to analyze individual data items but also the relationships between the assigned labels. Employing different sources and algorithms, the label assignments differ. We need to understand these differences to identify shared and conflicting assignments. We propose a visualization technique that addresses these challenges. In graphs, we present the labels for any classification result as nodes and the pairwise overlaps of labels as links between them. These graphs are juxtaposed for the different results and can be diffed graphically. Clustering techniques are used to further analyze similarities between labels or classification results, respectively. We demonstrate our prototype in two application examples from the machine learning domain.",
        "fallback": "In multi-label classification, we do not only want to analyze individual data items but also the relationships between the assigned labels."
      }
    },
    "publications/Latif2021Visually": {
      "id": "Latif2021Visually",
      "type": "publication",
      "title": {
        "original": "Visually Connecting Historical Figures Through Event Knowledge Graphs",
        "fallback": "Visually Connecting Historical Figures Through Event Know..."
      },
      "description": {
        "original": "Knowledge graphs store information about historical figures and their relationships indirectly through shared events. We developed a visualization system, VisKonnect, for analyzing the intertwined lives of historical figures based on the events they participated in. A user's query is parsed for identifying named entities, and related data is retrieved from an event knowledge graph. While a short textual answer to the query is generated using the GPT-3 language model, various linked visualizations provide context, display additional information related to the query, and allow exploration.",
        "fallback": "Knowledge graphs store information about historical figures and their relationships indirectly through shared events."
      }
    },
    "publications/Laurent2021Flatland": {
      "id": "Laurent2021Flatland",
      "type": "publication",
      "title": {
        "original": "Flatland Competition 2020: {MAPF} and {MARL} for Efficient Train Coordination on a Grid World",
        "fallback": "Flatland Competition 2020: {MAPF} and {MARL} for Efficien..."
      },
      "description": {
        "original": "The Flatland competition aimed at finding novel approaches to solve the vehicle re-scheduling problem (VRSP). The VRSP is concerned with scheduling trips in traffic networks and the re-scheduling of vehicles when disruptions occur, for example the breakdown of a vehicle. While solving the VRSP in various settings has been an active area in operations research (OR) for decades, the ever-growing complexity of modern railway networks makes dynamic real-time scheduling of traffic virtually impossible. Recently, multi-agent reinforcement learning (MARL) has successfully tackled challenging tasks where many agents need to be coordinated, such as multiplayer video games. However, the coordination of hundreds of agents in a real-life setting like a railway network remains challenging and the Flatland environment used for the competition models these real-world properties in a simplified manner. Submissions had to bring as many trains (agents) to their target stations in as little time as possible. While the best submissions were in the OR category, participants found many promising MARL approaches. Using both centralized and decentralized learning based approaches, top submissions used graph representations of the environment to construct tree-based observations. Further, different coordination mechanisms were implemented, such as communication and prioritization between agents. This paper presents the competition setup, four outstanding solutions to the competition, and a cross-comparison between them.\t",
        "fallback": "The Flatland competition aimed at finding novel approaches to solve the vehicle re-scheduling problem (VRSP)."
      }
    },
    "publications/Agarwal2022Spatio": {
      "id": "Agarwal2022Spatio",
      "type": "publication",
      "title": {
        "original": "Spatio-temporal Analysis of Multi-agent Scheduling Behaviors on Fixed-track Networks",
        "fallback": "Spatio-temporal Analysis of Multi-agent Scheduling Behavi..."
      },
      "description": {
        "original": "Multi-agent systems require coordination among the agents to solve a given task. For movement on fixed-track networks, traditional scheduling algorithms have dominated so far, but the interest in autonomous and intelligent agents is growing as they promise to react to unexpected and exceptional situations more robustly. In this paper, we study data from the Flatland 2020 NeurIPS Competition, where trains move through a virtual rail network. We developed a timeline-based visualization that provides an overview of all train movements in a simulated episode, clearly hinting at different phases, non-optimal routes, and issues such as deadlocks. This view is complemented with a map view and a graph view, interactively linked through highlighting and synchronous animation. Defining regions of interest in the map builds an analysis graph for detailed inspection. A comparison mode allows contrasting two different episodes regarding the same rail network across all views. We have conducted this application study in close collaboration with the Flatland community. Identified analysis goals stem from interviews with key persons of the community, while the approach itself was developed in two iterations based on feedback from experts with diverse backgrounds. This feedback, together with an analysis of the winning submissions from the competition, confirms that the initial analysis goals can be answered.",
        "fallback": "Multi-agent systems require coordination among the agents to solve a given task."
      }
    },
    "publications/Agarwal2022CiteVis": {
      "id": "Agarwal2022CiteVis",
      "type": "publication",
      "title": {
        "original": "{CiteVis}: Visual Analysis of Overlapping Citation Intents as Dynamic Sets",
        "fallback": "{CiteVis}: Visual Analysis of Overlapping Citation Intent..."
      },
      "description": {
        "original": "A scientific article can be cited with different intents over several years. The citation intents can be inferred by classifying the citation text into different categories. With multiple citations to the same article, the citation intent categories overlap, making their analysis more challenging. We model the categories as dynamic sets and propose an approach to visualize temporal citation trends of an article across overlapping citation intents. The approach supports comparison between the citation trends of two seed articles of interest. The implemented prototype supports searching and selecting seed articles from a Semantic Scholar dataset.",
        "fallback": "A scientific article can be cited with different intents over several years."
      }
    },
    "publications/Agarwal2022Visualizing": {
      "id": "Agarwal2022Visualizing",
      "type": "publication",
      "title": {
        "original": "Visualizing the Evolution of Multi-agent Game-playing Behaviors",
        "fallback": "Visualizing the Evolution of Multi-agent Game-playing Beh..."
      },
      "description": {
        "original": "Analyzing the training evolution of AI agents in a multi-agent environment helps to understand changes in learned behaviors, as well as the sequence in which they are learned. We train an existing Pommerman team from scratch and, at regular intervals, let it battle against another top-performing team. We define thirteen game-specific behaviors and compute their occurrences in 600 matches. To investigate the evolution of these behaviors, we propose a visualization approach and showcase its usefulness in an application example.",
        "fallback": ""
      }
    },
    "publications/Agarwal2023Visualizing": {
      "id": "Agarwal2023Visualizing",
      "type": "publication",
      "title": {
        "original": "Visualizing Element Interactions in Dynamic Overlapping Sets",
        "fallback": "Visualizing Element Interactions in Dynamic Overlapping Sets"
      },
      "description": {
        "original": "Elements---the members in sets---may change their memberships over time. Moreover, elements also directly interact with each other, indicating an explicit connection between them. Visualizing both together becomes challenging. Using an existing dynamic set visualization as a basis, we propose an approach to encode the interactions of elements together with changing memberships in sets. We showcase the value in visually analyzing both aspects of elements together through two application examples. The first example shows the evolution of business portfolio and interactions (e.g., acquisitions and partnerships) among companies. A second example analyzes the dynamic collaborative interactions among researchers in computer science.",
        "fallback": "Elements---the members in sets---may change their memberships over time."
      }
    },
    "publications/Liebers2023CohExplore": {
      "id": "Liebers2023CohExplore",
      "type": "publication",
      "title": {
        "original": "{CohExplore: Visually Supporting Students in Exploring Text Cohesion}",
        "fallback": "{CohExplore: Visually Supporting Students in Exploring Te..."
      },
      "description": {
        "original": "A cohesive text allows readers to follow the described ideas and events. Exploring cohesion in text might aid students enhancing their academic writing. We introduce CohExplore, which promotes exploring and reflecting on cohesion of a given text by visualizing computed cohesion-related metrics on an overview and detailed level. Detected topics are color-coded, semantic similarity is shown via lines, while connectives and co-references in a paragraph are encoded using text decoration. Demonstrating the system, we share insights about a student-authored text.",
        "fallback": "A cohesive text allows readers to follow the described ideas and events."
      }
    },
    "publications/Pron2024Comparative": {
      "id": "Pron2024Comparative",
      "type": "publication",
      "title": {
        "original": "Comparative Analysis of Timeline-based Visualizations for Dynamic Overlapping Sets",
        "fallback": "Comparative Analysis of Timeline-based Visualizations for..."
      },
      "description": {
        "original": "Timeline-based set visualizations provide an overview of how overlapping categorical data evolves. We study three different visualization techniques of such type and made minor modifications to visualize the same data in a two-fold comparison. First, we contrast their encodings and interactions through a conceptual analysis. Second, in a user study with 28 participants, we evaluate their performance regarding different analysis tasks for dynamic sets and record user feedback along various dimensions.",
        "fallback": "Timeline-based set visualizations provide an overview of how overlapping categorical data evolves."
      }
    },
    "publications/Agarwal2023Dissertation": {
      "id": "Agarwal2023Dissertation",
      "type": "publication",
      "title": {
        "original": "Exploring Complex Group Dynamics: Visual Analysis of Overlapping Groups and Interactions Over Time",
        "fallback": "Exploring Complex Group Dynamics: Visual Analysis of Over..."
      },
      "description": {
        "original": "Analyzing group dynamics is crucial to understand the behaviors of members in groups. The analysis could help answer important questions: How does the relationship between group members change over time? What is the effect of an action of a member on others? How do group members coordinate their efforts to achieve a goal? What are the overall changes in group behaviors over time? This thesis proposes novel techniques for visually exploring group dynamics, thereby aiding in answering such questions. The proposed techniques apply to diverse scenarios, as demonstrated through application examples. This work focuses on the two characteristic features of group dynamics. First, since members can belong to multiple groups simultaneously, it results in overlaps between groups. We propose two novel visualizations to analyze dynamic memberships in overlapping groups. Their effectiveness is demonstrated by insights from application examples, e.g., authors evolving research interests, classification models performance in their training process, and developer contributions in software repositories. Second, the interactions among group members. A design and application space is proposed to explore user behaviors from mixed reality sessions. Three visualizations are presented to investigate collaborative and competitive interactions among members. The studied scenarios include humans interacting in mixed reality and autonomous agents collaborating and competing in simulated environments. We propose an example of an integrated visual representation to show dynamic memberships in overlapping groups and entity interactions. The thesis discusses the future possibilities in encoding enriched interactions and describes a few works in progress. Finally, the thesis summarizes the contributions, highlights the limitations of the proposed visualizations, and presents a brief outlook toward the future.",
        "fallback": "Analyzing group dynamics is crucial to understand the behaviors of members in groups."
      }
    },
    "projects/project-cxpcp": {
      "id": "project-cxpcp",
      "type": "projects",
      "title": {
        "original": "Category Extended Parallel Coordinates Plot",
        "fallback": "Category Extended Parallel Coordinates Plot"
      },
      "description": {
        "original": "Category Extended Parallel Coordinates Plot (CXPCP) is a visualization technique that allows users to explore and analyze high-dimensional data with categorical variables in a single plot. It extends the traditional parallel coordinates plot by adding a category axis, enabling users to visualize and compare data across different (overlapping)categories.",
        "fallback": ""
      }
    },
    "projects/project-incois": {
      "id": "project-incois",
      "type": "projects",
      "title": {
        "original": "Ocean Explorer: A Visualization Tool for Meteorologists",
        "fallback": "Ocean Explorer: A Visualization Tool for Meteorologists"
      },
      "description": {
        "original": "Developed a desktop application for the Indian Meteorological Department (IMD) to visualize and analyze meteorological data from devices deployed in the Indian Ocean region. The application provides a user-friendly interface for exploring multivariate time series data with rich interactions.",
        "fallback": ""
      }
    },
    "mentorships/mentorship_2018Visualizing": {
      "id": "mentorship_2018Visualizing",
      "type": "mentorships",
      "title": {
        "original": "Visualizing Behavior of AI Players in Computer Games",
        "fallback": "Visualizing Behavior of AI Players in Computer Games"
      },
      "description": {
        "original": "In this project, the student explored training and tracking the behavior of artificial intelligence (AI) of playing the computer game Super Mario World. The visualizations helped to track the evolving learning of AI models across generations (genetic algorithm used to train AI model) for a game stage and its generalization to other stages (see figure). This project laid the groundwork for a future bachelor thesis aimed at expanding these techniques for broader applications beyond video games.",
        "fallback": ""
      }
    },
    "mentorships/mentorship_2019Visualizing": {
      "id": "mentorship_2019Visualizing",
      "type": "mentorships",
      "title": {
        "original": "Visualizing Behavior of AI Players in Computer Games",
        "fallback": "Visualizing Behavior of AI Players in Computer Games"
      },
      "description": {
        "original": "This thesis explores the concept of improving game designs by testing video games, specifically Sonic the Hedgehog. While testing video games is essential, it can be expensive and time-consuming when done by people. Instead, AI can be used to play the games, gathering valuable data. This data is too large to analyze manually, so it is summarized and visualized to make it understandable and improve the game design. This project builds on a previous bachelor project, creating a system to help visualize and understand how AI learns and evolves in games.",
        "fallback": "This thesis explores the concept of improving game designs by testing video games, specifically Sonic the Hedgehog."
      }
    },
    "mentorships/mentorship_2020Visual": {
      "id": "mentorship_2020Visual",
      "type": "mentorships",
      "title": {
        "original": "Visual Comparison of Reinforcement Learning Algorithms based on their Performance",
        "fallback": "Visual Comparison of Reinforcement Learning Algorithms ba..."
      },
      "description": {
        "original": "Most comparisons of reinforcement learning algorithms focus solely on reward outcomes, offering limited insights. This thesis demonstrated a more comprehensive approach of visualizing multiple performanceindicators using line graphs and parallel coordinates. This gave detailed insights into each algorithm's performance over time and the relationships between different indicators. Users can filter data to focus on specific aspects, reducing complexity. This method allows for a task-oriented comparison, offering valuable insights for practical applications, though it is specific to the task at hand.",
        "fallback": "Most comparisons of reinforcement learning algorithms focus solely on reward outcomes, offering limited insights."
      }
    },
    "mentorships/mentorship_2020Visualization": {
      "id": "mentorship_2020Visualization",
      "type": "mentorships",
      "title": {
        "original": "Visualization of Innovative Capacity in Regional Innovation Systems of Medical Devices for Cardiovascular Disease",
        "fallback": "Visualization of Innovative Capacity in Regional Innovati..."
      },
      "description": {
        "original": "This bachelor thesis proposed to explore the innovative capacity of regional systems in the medical device sector for cardiovascular disease. By applying established computer science visualization techniques, the project aimed to support health economics. In collaboration with a health economics research center, the thesis aimed to focus on identifying innovation hubs and their connections using data from PubMed. However, sadly the thesis was not completed due to the student's circumstances.",
        "fallback": "This bachelor thesis proposed to explore the innovative capacity of regional systems in the medical device sector for cardiovascular disease."
      }
    },
    "mentorships/mentorship_2021Interactive": {
      "id": "mentorship_2021Interactive",
      "type": "mentorships",
      "title": {
        "original": "Towards Interactive Data Comics",
        "fallback": "Towards Interactive Data Comics"
      },
      "description": {
        "original": "This thesis explored interactive storytelling with data in the popular format of comics. By incorporating multimedia and user-controlled features, the thesis aimed to make data stories more engaging and interesting. The interactions are demonstrated through three stories focusing on various aspects of the COVID-19 pandemic in Germany, encouraging readers to explore and understand the data more deeply.",
        "fallback": "This thesis explored interactive storytelling with data in the popular format of comics."
      }
    },
    "mentorships/mentorship_2021EventSequences": {
      "id": "mentorship_2021EventSequences",
      "type": "mentorships",
      "title": {
        "original": "Visual Comparison of Event Sequences and Supporting Hypotheses Generation for Emergency Training",
        "fallback": "Visual Comparison of Event Sequences and Supporting Hypot..."
      },
      "description": {
        "original": "This outstanding thesis introduced an innovative visual analytic system aimed at enhancing the triage process for accident victims. By analyzing sequences from triage training videos, the system supports experts in improving communication and teamwork. It includes a glyph-based graph and a timeline for visualizing and comparing training sessions, along with a pattern-finding algorithm for identifying communication patterns. Expert evaluations confirmed its effectiveness in data comparison and hypothesis generation. The system's adaptable design holds potential for broader applications in analyzing time-dependent event data.",
        "fallback": "This outstanding thesis introduced an innovative visual analytic system aimed at enhancing the triage process for accident victims."
      }
    },
    "mentorships/mentorship_2021Visualizing": {
      "id": "mentorship_2021Visualizing",
      "type": "mentorships",
      "title": {
        "original": "Visualizing Evolution of Collaboration among Organizations",
        "fallback": "Visualizing Evolution of Collaboration among Organizations"
      },
      "description": {
        "original": "This thesis developed a visualization approach to explore and understand academic collaboration networks, which are crucial for scientific productivity. The approach uses time series, geospatial maps, and node-link graphs to represent collaborations between countries, research institutions, and universities. Interactive features allow users to explore different aspects of the data, enhancing clarity and insight. The work demonstrated valuable insights into the dynamics of academic collaboration over time.",
        "fallback": ""
      }
    },
    "mentorships/mentorship_2021Visual": {
      "id": "mentorship_2021Visual",
      "type": "mentorships",
      "title": {
        "original": "Visualizing Game AI and Human Collaborative GamePlay Behavior",
        "fallback": "Visualizing Game AI and Human Collaborative GamePlay Beha..."
      },
      "description": {
        "original": "Game AI research is expanding beyond creating agents that compete with professional players to developing AI that collaborates with humans. This shift presents challenges, as existing algorithms aren't designed for teamwork. Understanding which collaborative behaviors are learned and exhibited by AI can enhance its development, but discovering them remained a challenge. This thesis reviewed the related potential visualizations and proposed  new apptoach to analyze interactions between AI and human players. Using data from a game environment based on Overcooked, a tool was developed to successfully visualize AI and human teamwork via interactive visualizations, revealing unknown collabotion strategies and behaviors.",
        "fallback": "Game AI research is expanding beyond creating agents that compete with professional players to developing AI that collaborates with humans."
      }
    },
    "mentorships/mentorship_2021Workshop": {
      "id": "mentorship_2021Workshop",
      "type": "mentorships",
      "title": {
        "original": "Visually Analysing Spatio-Temporal Workshop Production Data through Dynamic Graphs",
        "fallback": "Visually Analysing Spatio-Temporal Workshop Production Da..."
      },
      "description": {
        "original": "With the rise of geo-tracking in devices, vast amounts of location-based data are being generated. While computers can process this data, human insight is needed to interpret it meaningfully. This thesis presented a method to analyze and understand such data in a factory setting. Using movement data from pallets tracked with markers, a prototype visualization approach was developed and tested with experts. It integrates heatmap visualizations to highlight key areas and a dynamic graph to show movement patterns. Expert feedback confirmed that this approach effectively analyzes spatial and temporal data, helping identify important areas and movement patterns in production and storage. This understanding can improve machine operations and pallet handling, benefiting business operations.",
        "fallback": "With the rise of geo-tracking in devices, vast amounts of location-based data are being generated."
      }
    },
    "mentorships/mentorship_2022Visually": {
      "id": "mentorship_2022Visually",
      "type": "mentorships",
      "title": {
        "original": "Visually Exploring Team Communication and Gameplay Events in League of Legends",
        "fallback": "Visually Exploring Team Communication and Gameplay Events..."
      },
      "description": {
        "original": "This project developed a prototype for the underexplored area of visually analyzing team communication. The work takes League of Legends as a case study. It features four components: a Scoreboard, Voice Activity Bar Chart, Terminology Word Cloud, and Event Timeline. These linked views allow users to explore and identify their strengths and weaknesses. The findings demonstrate that specific insights can be gained from individual matches, and the prototype offers potential for further development to enhance quantitative analysis.",
        "fallback": "This project developed a prototype for the underexplored area of visually analyzing team communication."
      }
    },
    "mentorships/mentorship_2022Assisting": {
      "id": "mentorship_2022Assisting",
      "type": "mentorships",
      "title": {
        "original": "Assisting the Creation of Data Comics with Knowledge Graphs",
        "fallback": "Assisting the Creation of Data Comics with Knowledge Graphs"
      },
      "description": {
        "original": "This thesis explored an interesting concept of using Knowledge Graphs to create Data Comics, which are tools for visual storytelling with data. Creating Data Comics is typically complex, but the proposed framework simplifies this by streamlining data acquisition, formatting, and visualization. Its modular design allows for component reuse and integration with other tools. The 'Comic Templating' feature lets authors create an interactive Data Comic once and easily generate similar ones. By integrating Knowledge Graphs, users can explore the data behind a Data Comic and related information.",
        "fallback": "This thesis explored an interesting concept of using Knowledge Graphs to create Data Comics, which are tools for visual storytelling with data."
      }
    },
    "mentorships/mentorship_2022Bomberland": {
      "id": "mentorship_2022Bomberland",
      "type": "mentorships",
      "title": {
        "original": "Visual Analysis of AI Behavior in the Environment of Bomberland",
        "fallback": "Visual Analysis of AI Behavior in the Environment of Bomb..."
      },
      "description": {
        "original": "This thesis explores how visual tools can help developers understand and improve AI behavior in games, using the Bomberland competition as a case study. By analyzing data from AI matches, the research aims to make it easier to compare strategies and identify areas for improvement. The thesis introduces a web-based tool that uses various visualizations to simplify complex data, making it accessible even to non-experts. Interviews with competition organizers provided valuable insights and data, which were used to design the visualizations. The tool allows users to analyze AI strategies in real-time, offering a new way to enhance AI development. Feedback from a survey of AI developers confirmed the tool's effectiveness, though it highlighted the need for further refinement. This work builds on previous research and sets the stage for future advancements in AI analysis.",
        "fallback": ""
      }
    },
    "mentorships/mentorship_2023Gamified": {
      "id": "mentorship_2023Gamified",
      "type": "mentorships",
      "title": {
        "original": "Gamified visualizations to understand the concept of fairness and bias in machine learning",
        "fallback": "Gamified visualizations to understand the concept of fair..."
      },
      "description": {
        "original": "This thesis explores the use of gamified visualizations to help non-experts understand fairness and bias in machine learning. As AI technologies rapidly evolve, they pose challenges and risks, such as biased decision-making. The research addresses the gap in educational tools by creating interactive visualizations that incorporate game-like elements, making complex AI concepts more accessible. Prototypes were developed and tested, revealing both the potential and challenges of this approach. The work highlights the importance of educating the public to ensure AI benefits everyone, proposing gamified visualizations as a powerful tool for empowerment and understanding. This innovative approach aims to enhance transparency and engagement in AI literacy.",
        "fallback": "This thesis explores the use of gamified visualizations to help non-experts understand fairness and bias in machine learning."
      }
    },
    "mentorships/mentorship_2023Visual": {
      "id": "mentorship_2023Visual",
      "type": "mentorships",
      "title": {
        "original": "Visual Specification and Exploration of Rules to Generate  Game Levels with Wave Function Collapse Algorithm",
        "fallback": "Visual Specification and Exploration of Rules to Generate..."
      },
      "description": {
        "original": "In this innovative thesis, the student explored the use of the Wave Function Collapse algorithm to enhance game level design. This research introduced a web-based tool that visualizes the rules and restrictions of this algorithm, allowing designers to critically assess and refine level generation processes. By focusing on two-dimensional tile-based levels, the tool aids in understanding how different tiles interact, ensuring levels are both playable and engaging. The study also highlighted the importance of visualizing accessibility within levels, although it did not delve into player behavior. This work offers practical insights for game developers, emphasizing the potential of procedural content generation to create dynamic and varied gaming experiences.",
        "fallback": "In this innovative thesis, the student explored the use of the Wave Function Collapse algorithm to enhance game level design."
      }
    },
    "mentorships/mentorship_2023DataComics": {
      "id": "mentorship_2023DataComics",
      "type": "mentorships",
      "title": {
        "original": "Analyzing and Exploring the Design of Data Comics",
        "fallback": "Analyzing and Exploring the Design of Data Comics"
      },
      "description": {
        "original": "In a world overflowing with data, this thesis makes complex information more accessible through data comics. These comics blend the visual appeal of infographics with the narrative flow of comic strips, offering a novel way to present data step-by-step. The research involved analyzing 31 existing data comics to understand their design and exploring new visualization techniques to enhance them. By creating and evaluating five comic prototypes, the study provided insights into integrating complex data into engaging narratives. This work highlights the potential of data comics to improve public understanding and decision-making in an increasingly data-driven society.",
        "fallback": "In a world overflowing with data, this thesis makes complex information more accessible through data comics."
      }
    },
    "mentorships/mentorship_2023Diplomacy": {
      "id": "mentorship_2023Diplomacy",
      "type": "mentorships",
      "title": {
        "original": "Visual analysis of AI behavior in Diplomacy",
        "fallback": "Visual analysis of AI behavior in Diplomacy"
      },
      "description": {
        "original": "In a world increasingly influenced by Artificial Intelligence (AI), this thesis delves into the intriguing intersection of AI and the classic board game, Diplomacy. By examining AI behavior within this strategic game, the work uncovers valuable insights into game theory, social dynamics, and algorithmic progress. The study not only highlights the synergy between AI and human players but also emphasizes the timeless relevance of Diplomacy, akin to chess. The research addresses existing gaps in visualizing and analyzing the game, aiming to develop an application that enhances understanding of AI decision-making and improves gameplay strategies. This visualization offers practical benefits for players, coaches, and enthusiasts alike.",
        "fallback": ""
      }
    },
    "mentorships/mentorship_2023Poker": {
      "id": "mentorship_2023Poker",
      "type": "mentorships",
      "title": {
        "original": "Visual Analytics of Event Sequence Data in Poker",
        "fallback": "Visual Analytics of Event Sequence Data in Poker"
      },
      "description": {
        "original": "With online poker's popularity skyrocketing during the pandemic, this thesis tackles a crucial challenge: how to help players learn from their games more effectively. By analyzing the complex sequence of poker hands and player actions, the study introduces an innovative approach to reviewing gameplay. The research focuses on Texas Hold'em, where players can play 75-100 hands per hour, making traditional hand-by-hand analysis time-consuming. The work proposes a sequential perspective to visualize dynamic game processes, helping players better understand their decisions and improve their strategy.",
        "fallback": ""
      }
    },
    "mentorships/mentorship_2024EventSequences": {
      "id": "mentorship_2024EventSequences",
      "type": "mentorships",
      "title": {
        "original": "Visual Analysis and Interactive Clustering of Event Sequences",
        "fallback": "Visual Analysis and Interactive Clustering of Event Seque..."
      },
      "description": {
        "original": "In a bid to enhance e-commerce experiences, this thesis explores the use of interactive clustering to analyze customer journeys. By leveraging event sequence data, the study aims to improve understanding of user behavior on websites. The innovative approach combines various visualizations, to offer both an overview and detailed insights into customer interactions. This method allows for the identification of unusual patterns and enhances decision-making in marketing and user experience design. This work, conducted with data from a musical instrument retailer, highlights the potential of interactive clustering to reveal valuable customer insights, ultimately aiding in boosting sales and refining marketing strategies.",
        "fallback": "In a bid to enhance e-commerce experiences, this thesis explores the use of interactive clustering to analyze customer journeys."
      }
    },
    "mentorships/mentorship_2023Effectiveness": {
      "id": "mentorship_2023Effectiveness",
      "type": "mentorships",
      "title": {
        "original": "Effectiveness and Usability Towards Data-Driven Storytelling: A Comparison of Interactive Infographics and Data Comics",
        "fallback": "Effectiveness and Usability Towards Data-Driven Storytell..."
      },
      "description": {
        "original": "In an era where visual communication increasingly shapes public understanding, this master's thesis investigates the effectiveness of interactive data storytelling formats. It compares interactive infographics and data comics, two popular methods for presenting complex information to the general public. Building on previous research that found static data comics more effective than static infographics, the work explores whether these findings hold true for interactive versions. Through user studies and prototype development, the research examines both effectiveness and usability factors, including engagement, understanding, and user satisfaction. The findings aim to guide journalists and content creators in choosing the most effective format for their data-driven stories, particularly in online journalism where accessibility to diverse audiences is crucial.",
        "fallback": ""
      }
    },
    "mentorships/mentorship_2023DynamicSet": {
      "id": "mentorship_2023DynamicSet",
      "type": "mentorships",
      "title": {
        "original": "Dynamic Set Visualization: A User Study",
        "fallback": "Dynamic Set Visualization: A User Study"
      },
      "description": {
        "original": "Visualizing how groups change over time presents a unique challenge in data analysis. This thesis investigates three innovative approaches to visualizing dynamic sets: PAOHvis, TimeSets, and Set Streams. Through a comprehensive user study, the work evaluates how effectively these techniques help users understand evolving relationships between different groups. The findings aim to establish best practices for dynamic set visualization, identify key tasks that need support, and determine the strengths and limitations of current approaches. It revealed valuable insights for data analysts and visualization experts working with time-evolving data, offering practical guidance for choosing and designing dynamic set visualization techniques.",
        "fallback": "Visualizing how groups change over time presents a unique challenge in data analysis."
      }
    },
    "mentorships/mentorship_2023KNN": {
      "id": "mentorship_2023KNN",
      "type": "mentorships",
      "title": {
        "original": "K-Nearest-Neighbor learning application in Augmented Reality",
        "fallback": "K-Nearest-Neighbor learning application in Augmented Reality"
      },
      "description": {
        "original": "Machine learning's growing influence in everyday life has created an urgent need for accessible educational tools. This master's project introduces an innovative approach to teaching machine learning basics through an interactive Augmented Reality application for the HoloLens device. The application features a K-Nearest-Neighbor classifier that users can train and test in an immersive 3D environment. By combining playful techniques with visualizations, the work demonstrates how complex machine learning concepts can be made accessible to non-technical users. The project leverages the advantages of Augmented Reality technology to create an engaging learning experience, while addressing the challenges of implementing educational content in mixed reality environments.",
        "fallback": "Machine learning's growing influence in everyday life has created an urgent need for accessible educational tools."
      }
    },
    "mentorships/mentorship_2023Confusion": {
      "id": "mentorship_2023Confusion",
      "type": "mentorships",
      "title": {
        "original": "Visual Analysis and Comparison of the Confusion in Multi-Label Classifiers",
        "fallback": "Visual Analysis and Comparison of the Confusion in Multi-..."
      },
      "description": {
        "original": "With the explosion of digital data in recent years, the challenge of accurately categorizing information has become increasingly complex. This thesis tackles a specific challenge in machine learning: how to effectively compare and visualize the performance of different multi-label classifiers in a storytelling format. The work introduces an innovative approach that combines automatic detection of relevant confusion patterns with template-based text generation to create clear, understandable visualizations. By focusing on the interconnected nature of multi-label classifications, the thesis provides practical tools to better understand and compare classifier performance, ultimately leading to more informed model selection decisions.",
        "fallback": "With the explosion of digital data in recent years, the challenge of accurately categorizing information has become increasingly complex."
      }
    },
    "mentorships/mentorship_2024Sentiment": {
      "id": "mentorship_2024Sentiment",
      "type": "mentorships",
      "title": {
        "original": "Visual Exploration of Sentiment and Keywords from Social Media Posts",
        "fallback": "Visual Exploration of Sentiment and Keywords from Social ..."
      },
      "description": {
        "original": "Social media platforms have become powerful tools for understanding public opinion and trends, but analyzing their vast amounts of data presents significant challenges. This thesis introduces an innovative visual analytics tool that combines sentiment analysis and keyword extraction to make social media data more accessible and understandable. The work addresses a critical gap in existing tools, which often focus on geospatial data or topics while neglecting the rich textual content that reveals what people are saying and how they're saying it. By developing an intuitive interface that integrates multiple visualization techniques, the research enables users of varying expertise levels to explore and derive meaningful insights from social media discourse. The tool's design emphasizes three key aspects: data-appropriate visualizations, interactive exploration capabilities, and effective insight derivation.",
        "fallback": ""
      }
    },
    "mentorships/mentorship_2024Journalism": {
      "id": "mentorship_2024Journalism",
      "type": "mentorships",
      "title": {
        "original": "Exploring Interactive Data-Driven Storytelling in Local Journalism",
        "fallback": "Exploring Interactive Data-Driven Storytelling in Local J..."
      },
      "description": {
        "original": "Through analysis of 30 articles from six local media outlets, this thesis studies local journalism already incorporates data elements similar to national publications, but with a unique local focus. The research develops four innovative storytelling concepts: text-centric with visual extensions, visualization-centric with text support, time-based topic summaries, and map-based article organization. Expert interviews with journalists confirm the potential of data-driven storytelling in local contexts while highlighting resource constraints. This work provides actionable insights for modernizing local journalism through interactive data visualization, ensuring communities maintain access to professional, engaging local news in the digital age.",
        "fallback": ""
      }
    },
    "mentorships/mentorship_2024Personalization": {
      "id": "mentorship_2024Personalization",
      "type": "mentorships",
      "title": {
        "original": "Personalization in Interactive Data Comics",
        "fallback": "Personalization in Interactive Data Comics"
      },
      "description": {
        "original": "Imagine a world where data stories adapt to each reader's interests and experiences. This innovative thesis explores how personalization can transform interactive data comics into engaging, self-reflective experiences. It introduces a novel framework for creating personalized data stories that adapt to user characteristics and incorporate personal data, making complex information more relatable and memorable.",
        "fallback": "Imagine a world where data stories adapt to each reader's interests and experiences."
      }
    },
    "mentorships/mentorship_2024MixedReality": {
      "id": "mentorship_2024MixedReality",
      "type": "mentorships",
      "title": {
        "original": "Visualizing Player Movement and Events in Video Games through Space-Time Cubes in Mixed Reality",
        "fallback": "Visualizing Player Movement and Events in Video Games thr..."
      },
      "description": {
        "original": "Step into a world where game data comes alive in three dimensions. This exciting and innovative thesis introduces PomXR, an innovative Mixed Reality visualization tool that transforms how we understand player movements and game events. By combining spatial and temporal data in an immersive 3D environment, this research revolutionizes game analytics for both developers and players.",
        "fallback": "Step into a world where game data comes alive in three dimensions."
      }
    },
    "mentorships/mentorship_2025Onboarding": {
      "id": "mentorship_2025Onboarding",
      "type": "mentorships",
      "title": {
        "original": "Exploring The Onboarding To Dashboards With Data Comics",
        "fallback": "Exploring The Onboarding To Dashboards With Data Comics"
      },
      "description": {
        "original": "How do you understand a complex dashboard without any guidance? The thesis proposes exploring how the familiar format of comics can transform how we learn to use data dashboards. By combining the engaging narrative structure of comics with interactive data visualizations, this research introduces an innovative approach to making complex dashboards more accessible to non-expert users",
        "fallback": "How do you understand a complex dashboard without any guidance?"
      }
    }
  },
  "metadata": {
    "generatedAt": "2025-04-08T12:39:43.371Z",
    "version": "1.0"
  }
}